app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "last_name", "email", "phone", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "email" = ?, "password" = ?, "phone" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Macarena"], ["email", "mespinosa@miuandes.cl"], ["password", "macamacamaca"], ["phone", "944236941"], ["updated_at", "2019-04-17 20:15:42.061145"], ["id", 4]]